{-# LANGUAGE EmptyDataDeriving #-}
-- cover all cases!
{-# OPTIONS_GHC -fwarn-incomplete-patterns #-}
-- warn about incomplete patterns v2
{-# OPTIONS_GHC -fwarn-incomplete-uni-patterns #-}
-- write all your toplevel signatures!
{-# OPTIONS_GHC -fwarn-missing-signatures #-}
-- use different names!
{-# OPTIONS_GHC -fwarn-name-shadowing #-}
-- use all your pattern matches!
{-# OPTIONS_GHC -fwarn-unused-matches #-}
{-# OPTIONS_GHC -Wno-unrecognised-pragmas #-}
{-# HLINT ignore "Use any" #-}
{-# HLINT ignore "Use map" #-}

-- Задача 1: Да се дефинират типове Suit и Rank
-- Задача 2: Да се дефинира тип Card, който има следните полета: rank :: Rank, suit :: Suit
-- Задача 3: Да се напише функция, която генерира стандартно тесте от 52 карти
-- Задача 3: Да се дефинира тип Player, който има следните полета: name :: String, age :: Int, Hand :: [Card]
-- Задача 4: Да се напише функция, която приема списък от играчи и им раздава всички карти последователно
-- Задача 5: Да се напише функция, която приема списък от играчи и връща името на играча с най-висока сума от ранговете на картите в ръката му
-- Задача 6: Да се напише функция, която приема играч и връща всички червени карти от ръката му
-- Задача 7: Да се напише функция, която генерира стандартно тесте за игра на белот
-- Задача 8: Да се напише функция, която цепи тестето на подадено от играча място
-- Задача 9: Да се напише функция, която цепи тестето n пъти. Изберете произволен pattern, с който да направите безкрайния списък, от който се избира място за цепене
-- Задача 10: Да се напише функция, която раздава карти (приемете, че веднага е имало обявяване)
-- Задача 11: Да се напише функция, която приема карта и играч и избира коя карта от ръката му да играе 
    -- По възможност трябва да отговаря на боя и да е с по-висок ранк
    -- Ако играчът няма възможност да даде карта с по-висок ранк от същата боя, трябва да даде картата с най-нисък ранк от тази боя
    -- Ако играчът няма възможност да даде карта от същата боя, трябва да даде картата с най-нисък ранк в ръката си
    -- Ако има повече от една карта с най-нисък ранк да приоризира боите както в стандартна игра на белот
-- Задача 12: Да се напише функция, която преценя кой играч е взел ръката. Предполагаме, че първия играч в списъка е бил под ръка
-- Задача 13: Да се напише функция, която према ръка и играчите и размества списъка така, че взелият играч да е под ръка

